###
# Являются ли введенные числа квадратами
# a = int(input('Введите первое число '))
# b = int(input('Введите второе число '))
#
# if (a == b ** 2) or (b == a ** 2):
#     print('Да')
# else:
#     print('Нет')

# Максимум из чисел
# nums = [int(i) for i in input('Введите числа через пробел ').split()]
# maxx = nums[0]
# for i in range(1, len(nums)):
#     if maxx < nums[i]:
#         maxx = nums[i]
#
# print(f'Максимальное число это {maxx}')

# Вводим N. Выводим числа от -N до N
# a = int(input('Введите число '))
#
# for i in range(-a, a + 1):
#     print(i, end=' ')

# Вывести первую цифру дробной части числа
# num = float(input('Введите число '))
#
# print(int((num * 10) % 10))
